var latLongs = [[24.9899858,121.54073160000007],
[25.0881707,121.60054990000003],
[0,0],
[0,0],
[25.0890026,121.52288620000002],
[25.029726,121.55780679999998],
[25.0250745,121.51433199999997],
[25.0469337,121.58680809999998],
[25.043172,121.50359709999998],
[25.0291069,121.49883460000001],
[25.0619756,121.52574549999997],
[25.1325101,121.4992082],
[25.0671628,121.5133075],
[25.0803015,121.57534450000003],
[24.987736,121.55097410000008],
[25.0593151,121.5629083],
[25.0352389,121.54314199999999],
[24.9956341,121.54680600000006],
[25.0295316,121.51867270000002],
[25.04803,121.55985399999997],
[25.0296914,121.56361700000002],
[25.027326,121.54297510000004],
[25.07955,121.55136500000003],
[25.0596046,121.54530610000006],
[25.0722195,121.60516660000008],
[25.0279374,121.54044840000006],
[25.0352659,121.57377500000007],
[25.078471,121.55184099999997],
[25.1308953,121.49742709999998],
[25.0784073,121.59104290000005],
[25.083292,121.595551],
[25.057776,121.55373299999997],
[25.0299238,121.56550979999997],
[25.1172021,121.51714900000002],
[25.123104,121.52513499999998],
[25.0350167,121.55429920000006],
[25.022223,121.53115400000002],
[25.0405242,121.57359730000007],
[25.0394901,121.55194340000003],
[25.1100584,121.5197005],
[25.0462687,121.55157250000002],
[25.030713,121.54432500000007],
[25.0504424,121.55718720000004],
[25.0879609,121.52241900000001],
[25.0484166,121.54067110000005],
[25.1020518,121.52647200000001],
[25.034408,121.54718350000007],
[25.078019,121.5638401],
[24.999531,121.54589750000002],
[25.0352739,121.57366300000001],
[25.0844001,121.56504270000005],
[25.0264933,121.51779399999998],
[25.0580553,121.55895650000002],
[25.0380009,121.57448469999997],
[25.0366409,121.52536179999993],
[25.1035884,121.52070649999996],
[25.0536377,121.60817689999999],
[25.0707099,121.60796319999997],
[25.0610839,121.5220908],
[25.0527114,121.5372562],
[25.0707278,121.61603930000001],
[25.0401494,121.55610449999995],
[25.0480012,121.53209170000002],
[25.0534139,121.55169239999998],
[25.0073512,121.53925559999993],
[25.029909,121.52929700000004],
[25.0227478,121.54739749999999],
[25.0345501,121.55663300000003],
[25.0635041,121.54607629999998],
[25.1095091,121.52078729999994],
[25.0288316,121.5259575],
[25.0751135,121.58276790000002],
[25.1382209,121.49181599999997],
[25.0341717,121.55348129999993],
[25.052747,121.540255],
[25.0483528,121.55309590000002],
[25.017862,121.531792],
[25.0411799,121.58492690000003],
[25.132142,121.49629900000002],
[25.0559379,121.56737120000003],
[25.026694,121.53321600000004],
[25.0591689,121.55995299999995],
[25.0422753,121.54131380000001],
[25.0711851,121.60750499999995],
[25.0352389,121.54314199999999],
[25.049073,121.54042219999997],
[25.103476,121.52080060000003],
[25.059508,121.54830700000002],
[25.0597374,121.54001820000008],
[25.0834681,121.55171280000002],
[25.0463299,121.55500039999993],
[25.0301229,121.55172190000008],
[25.0526463,121.53062890000001],
[25.1158737,121.53216359999999],
[25.0580718,121.55557429999999],
[25.0366232,121.52523120000001],
[25.1083502,121.52373420000004],
[24.9836499,121.568847],
[25.068506,121.59424430000001],
[25.0471285,121.61429020000003],
[25.1185873,121.50888199999997],
[25.0309079,121.54587949999996],
[25.025056,121.53547300000002],
[25.0487086,121.56142339999997],
[25.0309977,121.50072439999997],
[25.0618449,121.56685500000003],
[25.0649307,121.51341720000005],
[25.118539,121.50872549999997],
[25.0536377,121.60817689999999],
[25.0518371,121.55432989999997],
[25.0826817,121.552727],
[24.9897329,121.573982],
[25.0774751,121.54950659999997],
[25.1165544,121.5264611],
[25.1092883,121.52948420000007],
[25.0603039,121.61497120000001],
[25.051828,121.55433059999996],
[25.0849201,121.51953120000007],
[25.0318285,121.56859259999999],
[25.0282266,121.53165779999995],
[25.0779712,121.58399689999999],
[25.0716767,121.60674900000004],
[25.0711875,121.60773610000001],
[24.9826401,121.56923529999995],
[25.0442159,121.52110500000003],
[25.0287167,121.50432890000002],
[25.0018265,121.55466049999995],
[25.0584553,121.53861819999997],
[25.0836683,121.50852310000005],
[25.0776146,121.5465074],
[25.1112184,121.52981150000005],
[25.0537315,121.55196879999994],
[25.118234,121.53389800000002],
[25.025979,121.5393206],
[25.022887,121.52790299999992],
[25.0788886,121.59835769999995],
[25.112896,121.53544899999997],];


function BabyCentor() {
	//臺北市嬰幼兒照顧服務-公辦民營托嬰中心
	this.publicBady = [{"addr":"臺北市11670羅斯福路六段455巷28號","orgname":"景美托嬰中心"},{"addr":"臺北市11456大湖山莊街170號","orgname":"大湖托嬰中心"},{"addr":"臺北市10673羅斯福路四段21號向陽樓","orgname":"大安托嬰中心"},{"addr":"臺北市10582三民路5號東陽樓1樓","orgname":"松山托嬰中心"},{"addr":"臺北市11162基河路130號1樓","orgname":"士林托嬰中心"},{"addr":"臺北市11052基隆路二段99號","orgname":"信義托嬰中心"},{"addr":"臺北市10071詔安街29號","orgname":"中正托嬰中心"},{"addr":"臺北市11556東新街65號","orgname":"南港托嬰中心"},{"addr":"臺北市10845成都路98號1樓","orgname":"萬華托嬰中心"},{"addr":"臺北市10864西藏路201號","orgname":"萬大托嬰中心"},{"addr":"臺北市10451林森北路511號","orgname":"中山托嬰中心"},{"addr":"臺北市11246光明路22號2樓","orgname":"北投托嬰中心"},{"addr":"臺北市10374重慶北路三段120巷2號3樓","orgname":"大同托嬰中心"},{"addr":"臺北市11444內湖路一段659號2樓","orgname":"內湖托嬰中心"},{"addr":"臺北市11645木柵路一段177號2樓","orgname":"文山托嬰中心"}]  
	//臺北市嬰幼兒照顧服務-兒童托育資源中心
	this.babyCenter=[{"addr":"臺北市10573民生東路五段163-1號9樓","orgname":"臺北市兒童托育資源中心"}]
	//「臺北市嬰幼兒照顧服務-臺北市私立托嬰中心」API存取
	this.privateCenter=[{"addr":"臺北市106信義路三段147巷15弄27-1號1樓","orgname":"臺北市私立人愛托嬰中心"},{"addr":"臺北市116景華街122號2樓","orgname":"臺北市私立育德托嬰中心"},{"addr":"臺北市100南昌路一段145號2樓","orgname":"臺北市私立小哈利托嬰中心"},{"addr":"臺北市105光復南路13巷43號1樓","orgname":"臺北市私立豐村托嬰中心"},{"addr":"臺北市110莊敬路289巷5弄28號1樓","orgname":"臺北市私立小熊的家托嬰中心"},{"addr":"臺北市106復興南路二段180巷4號1樓","orgname":"臺北市私立寶兒女成長園地托嬰中心"},{"addr":"臺北市104明水路567號","orgname":"臺北市私立漢妮托嬰中心"},{"addr":"臺北市105民權東路三段106巷21弄5號1樓","orgname":"臺北市私立勁寶兒民權托嬰中心"},{"addr":"臺北市114民權東路六段282號2樓","orgname":"臺北市私立快樂托嬰中心"},{"addr":"臺北市106瑞安街210號1樓","orgname":"臺北市私立橘子樹托嬰中心"},{"addr":"臺北市110松德路180巷9號1樓","orgname":"臺北市私立我們的托嬰中心"},{"addr":"臺北市104明水路541號1樓","orgname":"臺北市私立咕咕園托嬰中心"},{"addr":"臺北市112大興街23巷35號1樓","orgname":"臺北市私立芳馨園二館托嬰中心"},{"addr":"臺北市114星雲街36號1樓","orgname":"臺北市私立小小百合蒙特梭利托嬰中心"},{"addr":"臺北市114金湖路19號1樓","orgname":"臺北市私立貝比托嬰中心"},{"addr":"臺北市105民生東路四段80巷1弄11號1樓","orgname":"臺北市私立我們的松山托嬰中心"},{"addr":"臺北市110松智路35號1樓","orgname":"臺北市私立咕咕園信義托嬰中心"},{"addr":"臺北市112石牌路二段90巷17號2樓","orgname":"臺北市私立安格托嬰中心"},{"addr":"臺北市112石牌路二段352號1樓","orgname":"臺北市私立向暘托嬰中心"},{"addr":"臺北市106信義路四段265巷20弄20號1樓","orgname":"臺北市私立菲力兒托嬰中心"},{"addr":"臺北市106泰順街64號2樓","orgname":"臺北市私立全家托嬰中心"},{"addr":"臺北市110忠孝東路五段236巷3弄29號2樓","orgname":"臺北市私立薇薇安娃娃國托嬰中心"},{"addr":"臺北市106仁愛路四段151巷25號3樓","orgname":"臺北市私立芽芽托嬰中心"},{"addr":"臺北市112明德路113巷2弄2號1樓","orgname":"臺北市私立小豆子石牌托嬰中心"},{"addr":"臺北市105八德路三段12巷51弄19號1樓","orgname":"臺北市私立多多托嬰中心"},{"addr":"臺北市106瑞安街31巷5-2號1樓","orgname":"臺北市私立陽光小屋托嬰中心"},{"addr":"臺北市105光復北路100巷8號1樓","orgname":"臺北市私立凱思托嬰中心"},{"addr":"臺北市111承德路四段185號3樓","orgname":"臺北市私立孩子國托嬰中心"},{"addr":"臺北市104長安東路二段167號2樓","orgname":"臺北市私立真愛托嬰中心"},{"addr":"臺北市111中山北路五段852號1樓","orgname":"臺北市私立怡寶托嬰中心"},{"addr":"臺北市106四維路76巷11號1樓","orgname":"臺北市私立小磊心托嬰中心"},{"addr":"臺北市104基湖路149號1樓","orgname":"臺北市私立宜朵園蒙特梭利托嬰中心"},{"addr":"臺北市116興隆路二段61巷6號2樓","orgname":"臺北市私立育德興隆托嬰中心"},{"addr":"臺北市110松德路180巷11號1樓","orgname":"臺北市私立我們的信義托嬰中心"},{"addr":"臺北市114環山路一段24巷8號1樓","orgname":"臺北市私立櫻之圓蒙特梭利托嬰中心"},{"addr":"臺北市100廈門街10號1樓","orgname":"臺北市私立我們的中正托嬰中心"},{"addr":"臺北市105民生東路五段36巷4弄41號1樓","orgname":"臺北市私立哈寶寶托嬰中心"},{"addr":"臺北市110虎林街164巷60弄4號1樓","orgname":"臺北市私立薇薇安娃娃國信義園托嬰中心"},{"addr":"臺北市100杭州南路一段131巷5號2樓","orgname":"臺北市私立宥緣托嬰中心"},{"addr":"臺北市111文林路740巷9弄24號1樓","orgname":"臺北市私立怡寶優質托嬰中心"},{"addr":"臺北市115市民大道八段369號2樓之1","orgname":"臺北市私立我們的南港托嬰中心"},{"addr":"臺北市114民權東路六段296巷87號1樓","orgname":"臺北市私立拉斐爾托嬰中心"},{"addr":"臺北市104中山北路二段116巷9號2樓","orgname":"臺北市私立日光貝比托嬰中心"},{"addr":"臺北市104建國北路二段186巷7號1樓","orgname":"臺北市私立妙兒園托嬰中心"},{"addr":"臺北市114東湖路113巷50-2號1樓","orgname":"臺北市私立卡爾維德蒙特梭利托嬰中心"},{"addr":"臺北市106光復南路260巷29號1樓","orgname":"臺北市私立愷特托嬰中心"},{"addr":"臺北市104松江路46巷9-1號2樓","orgname":"臺北市私立笙愛托嬰中心"},{"addr":"臺北市105南京東路四段53巷10弄12號1樓","orgname":"臺北市私立耕心寶貝家族托嬰中心"},{"addr":"臺北市116萬盛街40號1樓","orgname":"臺北市私立勁寶兒公館托嬰中心"},{"addr":"臺北市106金華街223-5號2樓","orgname":"臺北市私立華康托嬰中心"},{"addr":"臺北市106敦化南路二段200巷20號1樓","orgname":"臺北市私立吉事達康博喜托嬰中心"},{"addr":"臺北市106延吉街257號1樓","orgname":"臺北市私立凱瑞莎托嬰中心"},{"addr":"臺北市105復興北路427巷23號1樓","orgname":"臺北市私立貞心托嬰中心"},{"addr":"臺北市112明德路118巷17號1樓","orgname":"臺北市私立幼輝托嬰中心"},{"addr":"臺北市106潮州街108號1樓","orgname":"臺北市私立亞瑟王皇家托嬰中心"},{"addr":"臺北市114陽光街150號1樓","orgname":"臺北市私立嘉霙托嬰中心"},{"addr":"臺北市112中央北路二段227號1樓","orgname":"臺北市私立芳馨園托嬰中心"},{"addr":"臺北市106安和路一段135巷14號1樓","orgname":"臺北市私立滿兒圓蒙特梭利托嬰中心"},{"addr":"臺北市104龍江路153號3樓","orgname":"臺北市私立我們的中山托嬰中心"},{"addr":"臺北市105八德路三段81號2樓之1","orgname":"臺北市私立采禾托嬰中心"},{"addr":"臺北市106羅斯福路三段283巷4弄13號1樓","orgname":"臺北市私立天心托嬰中心"},{"addr":"臺北市110中坡南路98巷2號1樓","orgname":"臺北市私立信義小太陽托嬰中心"},{"addr":"臺北市112大業路506-1號1樓","orgname":"臺北市私立可瑞荳托嬰中心"},{"addr":"臺北市105健康路325巷18弄2號1樓","orgname":"臺北市私立親子坊托嬰中心"},{"addr":"臺北市106和平東路一段183巷3弄2-1號1樓","orgname":"臺北市私立我們的古亭托嬰中心"},{"addr":"臺北市105民生東路五段69巷2弄32號1樓","orgname":"臺北市私立童欣寶貝熊托嬰中心"},{"addr":"臺北市106忠孝東路三段251巷4弄8號1樓","orgname":"臺北市私立璽愛托嬰中心"},{"addr":"臺北市114民權東路六段296巷61-1號1樓","orgname":"臺北市私立拉斐爾天使托嬰中心"},{"addr":"臺北市106信義路三段147巷15弄27-1號2樓","orgname":"臺北市私立勁寶兒大安托嬰中心"},{"addr":"臺北市104龍江路40號2樓","orgname":"臺北市私立麗茵蒙特梭利托嬰中心"},{"addr":"臺北市111文林路740巷9弄2號1樓","orgname":"臺北市私立怡寶資優托嬰中心"},{"addr":"臺北市105敦化北路222巷15號1樓","orgname":"臺北市私立健寶兒托嬰中心"},{"addr":"臺北市104合江街105巷16號1樓","orgname":"臺北市私立韋斯登托嬰中心"},{"addr":"臺北市104明水路672巷36號3樓之1","orgname":"臺北市私立愛美加托嬰中心"},{"addr":"臺北市105光復南路32巷40號1樓","orgname":"臺北市私立勁寶兒延吉托嬰中心"},{"addr":"臺北市106安和路二段70號2樓之5","orgname":"臺北市私立萌語托嬰中心"},{"addr":"臺北市104松江路124巷27號1樓","orgname":"臺北市私立松江蒙特梭利托嬰中心"},{"addr":"臺北市111忠誠路二段166巷31號1樓","orgname":"臺北市私立好來托嬰中心"},{"addr":"臺北市105民生東路五段39-2號1樓","orgname":"臺北市私立哈寶貝托嬰中心"},{"addr":"臺北市100杭州南路一段131巷3號2樓","orgname":"臺北市私立宥宜托嬰中心"},{"addr":"臺北市111磺溪街88巷6號1樓","orgname":"臺北市私立春田托嬰中心"},{"addr":"臺北市116木新路二段161巷4號1樓","orgname":"臺北市私立芳馨園木柵托嬰中心"},{"addr":"臺北市114民權東路六段190號1樓","orgname":"臺北市私立斑比諾托嬰中心"},{"addr":"臺北市115研究院路二段34巷13號1樓","orgname":"臺北市私立全育托嬰中心"},{"addr":"臺北市112吉利街162號1樓","orgname":"臺北市私立小腳ㄚ托嬰中心"},{"addr":"臺北市106大安路二段100號1樓","orgname":"臺北市私立摯愛人子托嬰中心"},{"addr":"臺北市106新生南路三段19巷3-1號1樓","orgname":"臺北市私立芭蒂恩蒙氏家園托嬰中心"},{"addr":"臺北市105八德路四段111號3樓","orgname":"臺北市私立健寶兒八德托嬰中心"},{"addr":"臺北市108萬大路61號2樓","orgname":"臺北市私立小育龍托嬰中心"},{"addr":"臺北市105富錦街552號1樓","orgname":"臺北市私立小晨星托嬰中心"},{"addr":"臺北市103重慶北路三段24號2樓","orgname":"臺北市私立詠荺托嬰中心"},{"addr":"臺北市112吉利街158號1樓","orgname":"臺北市私立貝兒托嬰中心"},{"addr":"臺北市115市民大道八段369號","orgname":"臺北市私立我們的中研托嬰中心"},{"addr":"臺北市105南京東路四段95號2樓","orgname":"臺北市私立悅福托嬰中心"},{"addr":"臺北市104樂群三路56號2樓","orgname":"臺北市私立萌家園托嬰中心"},{"addr":"臺北市116新光路一段31巷1號1樓","orgname":"臺北市私立牧羊人托嬰中心"},{"addr":"臺北市104明水路437號1樓","orgname":"臺北市私立愛寶貝托嬰中心"},{"addr":"臺北市111中山北路六段405巷70號1樓","orgname":"臺北市私立萌語天母托嬰中心"},{"addr":"臺北市111忠誠路二段32巷9號1樓","orgname":"臺北市私立春田天母托嬰中心"},{"addr":"臺北市115經貿二路231號2樓","orgname":"臺北市私立拉斐爾甜心托嬰中心"},{"addr":"臺北市105南京東路四段93號2樓","orgname":"臺北市私立悅和托嬰中心"},{"addr":"臺北市111前港街88號1樓","orgname":"臺北市私立怡寶質優托嬰中心"},{"addr":"臺北市110松勤街132號1樓","orgname":"臺北市私立維多利亞托嬰中心"},{"addr":"臺北市106青田街6-3號1樓","orgname":"臺北市私立凱瑞莎青田托嬰中心"},{"addr":"臺北市114文德路210巷10號1樓","orgname":"臺北市私立勁寶兒文德托嬰中心"},{"addr":"臺北市114民權東路六段296巷41-1號1樓","orgname":"臺北市私立維多爾托嬰中心"},{"addr":"臺北市114民權東路六段296巷48-3號1樓","orgname":"臺北市私立愛德芬托嬰中心"},{"addr":"臺北市116木新路二段161巷24弄2號1樓","orgname":"臺北市私立馥葆托嬰中心"},{"addr":"臺北市100青島東路1-3號1樓","orgname":"立法院附設臺北市私立員工子女托嬰中心(委託社團法人新北市嬰幼兒托育協會經營管理)"},{"addr":"臺北市108中華路二段364巷5號1樓","orgname":"臺北市私立安馨托嬰中心"},{"addr":"臺北市116辛亥路四段252巷8號1樓","orgname":"臺北市私立聖育音感托嬰中心"},{"addr":"臺北市104合江街100巷11號1樓","orgname":"臺北市私立布萊茲托嬰中心"},{"addr":"臺北市111葫蘆街140號1樓","orgname":"臺北市私立長藤托嬰中心"},{"addr":"臺北市104明水路389號1樓","orgname":"臺北市私立禾園托嬰中心"},{"addr":"臺北市111忠誠路二段70巷13弄1號1樓","orgname":"臺北市私立維薆托嬰中心"},{"addr":"臺北市105敦化北路145巷71號1樓","orgname":"臺北市私立天使寶貝蒙特梭利托嬰中心"},{"addr":"臺北市111天母東路61號3樓","orgname":"臺北市私立道思托嬰中心"},{"addr":"臺北市106瑞安街155巷2號","orgname":"臺北市私立橘子樹寶貝托嬰中心"},{"addr":"臺北市106師大路86巷4號1樓","orgname":"臺北市私立小天心托嬰中心"},{"addr":"臺北市114康寧路一段263號1樓","orgname":"臺北市私立我們的內湖托嬰中心"},{"addr":"臺北市111士東路244號1樓","orgname":"臺北市私立好來天母托嬰中心"}]

}

BabyCentor.prototype.publicBady = null;
BabyCentor.prototype.babyCenter = null;
BabyCentor.prototype.privateCenter = null;

let data = new BabyCentor();
data = data.publicBady.concat(data.babyCenter, data.privateCenter)

import faker from 'faker';
faker.locale = "zh_TW";

data = data.map(function (e, i) {
	e.name = faker.name.findName().split(' ').join('');
	e.email = faker.internet.email();
	e.avatar = faker.image.avatar();
	e.phone = faker.phone.phoneNumber();
	e.lanLong = latLongs[i];
	e.star = Math.floor(Math.random() * 2 * 10) / 10 + 3;
	e.availableTime = Math.random() > 0.5 ? 1 : 0;
	e.type = i % 2 == 0 ? "托兒所" : "保姆";
	return e;
})
data.length = 15;

export default data;
